Revit 2026 API

# AnnotationSymbolGetLeaders Method

---

Returns a collection of leaders currently attached to the annotation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Leader> GetLeaders()
```
```vb
Public Function GetLeaders As IList(Of Leader)
```
```cpp
public:
IList<Leader^>^ GetLeaders()
```
```fsharp
member GetLeaders : unit -> IList<Leader>
```

#### Return Value

IListLeader

This method supersedes an older _Leaders_ property which has been deprecated.

#### Reference

AnnotationSymbol Class

Autodesk.Revit.DB Namespace